# Імпортування модуля argparse для обробки команд та аргументів CLI додатку
import argparse

from main import generate_password


def process_cli_command():
    """Функція яка обробляє команди та аргументи CLI додатку"""
    # Створюємо екземпляр класу ArgumentParser для обробки аргументів
    parser = argparse.ArgumentParser(description="Password generator")

    # Додаємо аргументи які необхідно обробляти у CLI додатку
    parser.add_argument(
        "-l",  # Скорочене позначення аргументу
        "--length",  # Повне позначення аргументу
        required=False,  # Позначення що аргумент не є обов'язковим
        type=int,  # Тип даних аргументу
        default=8,  # Значення за замовчуванням аргументу
        help="Рядок який буде відображатись під час виклику --help",
    )
    parser.add_argument(
        "-n",  # Скорочене позначення аргументу
        "--numbers",  # Повне позначення аргументу
        required=False,  # Позначення що аргумент не є обов'язковим
        action="store_const",
        # Визначення дій яку необхідно виконати у разі передачі аргументу, а саме назначення const як значення для аргументу
        const=True,  # Константне значення яке буде призначено аргументу у разі передачі аргументу
        default=False,  # Значення за замовчуванням аргументу
        help="Рядок який буде відображатись під час виклику --help",
    )
    parser.add_argument(
        "-c",  # Скорочене позначення аргументу
        "--characters",  # Повне позначення аргументу
        required=False,  # Позначення що аргумент не є обов'язковим
        action="store_const",
        # Визначення дій яку необхідно виконати у разі передачі аргументу, а саме назначення const як значення для аргументу
        const=True,  # Константне значення яке буде призначено аргументу у разі передачі аргументу
        default=False,  # Значення за замовчуванням аргументу
        help="Рядок який буде відображатись під час виклику --help",
    )

    parser.add_argument(
        "-s",  # Скорочене позначення аргументу
        "--special_characters",  # Повне позначення аргументу
        required=False,  # Позначення що аргумент не є обов'язковим
        type=str,  # Тип даних аргументу
        default="-@_.*!",  # Значення за замовчуванням аргументу
        help="Рядок який буде відображатись під час виклику --help",
    )

    # Виклик функції parse_args для отримання об'єкту з усіма аргументами CLI додатку
    args = parser.parse_args()

    print(generate_password(args.length, args.numbers, args.characters, args.special_characters))


if __name__ == "__main__":
    # Викликати функцію process_cli_command тільки коли файл був запущений (не імпортований)
    process_cli_command()
